УТ_для_edt/src/InformationRegisters/CRM_НастройкаВерсионированияРеквизитовПартнеров/CRM_НастройкаВерсионированияРеквизитовПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкаВерсионированияРеквизитовПартнеров</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_НастройкаВерсионированияРеквизитовПартнеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Эта функция больше не используется, она нужна для перехода с релизов меньше 2_0_6_2 на более поздние,
// для получения признака ведения версионирования нужно использовать выражение
// ПолучитьФункциональнуюОпцию("CRM_ВестиИсториюРеквизитовКлиентов").
//
// Возвращаемое значение:
//	Булево - признак использования версионирования.
//
Функция ПолучитьИспользованиеВерсионирования() Экспорт
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Использовать ИЗ РегистрСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров ГДЕ Использовать = ИСТИНА");
		Возврат Не Запрос.Выполнить().Пустой();
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Процедура - Сохранить настройку версионирования в регистр.
//
// Параметры:
//  СтруктураНастройки	 - Структура - Структура настроек версионирования. Содержит поля:
//		* Реквизиты - Массив - имена реквизитов, которые необходимо версионировать в справочнике Партнеры.
//  	* РеквизитыКонтактногоЛица - Массив - имена реквизитов, которые необходимо версионировать в справочнике КонтактныеЛицаПартнеров.
//  	* РеквизитыИнтереса - Массив - имена реквизитов, которые необходимо версионировать в документе CRM_Интерес.
//
Процедура СохранитьНастройку(СтруктураНастройки) Экспорт
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗначениеНастройки = Новый ХранилищеЗначения(СтруктураНастройки);
	Попытка МенеджерЗаписи.Использовать = Истина;
	Исключение КонецПопытки;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Функция - Получить настройку версионирования объектов.
// 
// Возвращаемое значение:
//  Структура -  Структура настроек версионирования.
//  	Реквизиты - Массив с именами реквизитов, которые необходимо версионировать в справочнике Партнеры.
//  	РеквизитыКонтактногоЛица - Массив с именами реквизитов, которые необходимо версионировать в справочнике КонтактныеЛицаПартнеров.
//  	РеквизитыИнтереса - Массив с именами реквизитов, которые необходимо версионировать в документе CRM_Интерес.
//
Функция ПолучитьНастройку() Экспорт
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат Новый Структура("СтруктураНастройки", МенеджерЗаписи.ЗначениеНастройки.Получить());
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Функция - Получить список версионируемых реквизитов
// 
// Возвращаемое значение:
//  Список - СписокЗначений -  Возвращает полный список реквизитов версионирования справочника "Партнеры",
//  добавляет в список реквизиты ABCКласс и XYZКласс.
//
Функция ПолучитьСписокВерсионируемыхРеквизитов() Экспорт
	Список = Новый СписокЗначений();
	
	Настройка = РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.ПолучитьНастройку();
	Если ТипЗнч(Настройка) = Тип("Структура") Тогда
		Если (ТипЗнч(Настройка.СтруктураНастройки) <> Тип("Структура") Или Не Настройка.СтруктураНастройки.Свойство("Реквизиты")) Тогда
			Возврат Список;
		КонецЕсли;
	Иначе
		Возврат Список;
	КонецЕсли;
	Реквизиты = Настройка.СтруктураНастройки.Реквизиты;
	Если ТипЗнч(Реквизиты) <> Тип("Массив") Тогда Возврат Список; КонецЕсли;
	
	Для Каждого Реквизит Из Реквизиты Цикл
		Если ТипЗнч(Реквизит) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
			Список.Добавить(Реквизит, Строка(Реквизит));
		ИначеЕсли ТипЗнч(Реквизит) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			Список.Добавить(Реквизит, Строка(Реквизит));
		ИначеЕсли Реквизит = "Сегмент" Тогда
			Список.Добавить(Реквизит, НСтр("ru='Сегмент';en='Segment'"));
		Иначе
			НайденныйРеквизит = Неопределено;
			Для Каждого РеквизитМд Из Метаданные.Справочники.Партнеры.СтандартныеРеквизиты Цикл
				Если РеквизитМд.Имя = Реквизит Тогда
					НайденныйРеквизит = РеквизитМд;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденныйРеквизит = Неопределено Тогда
				Для Каждого РеквизитМд Из Метаданные.Справочники.Партнеры.Реквизиты Цикл
					Если РеквизитМд.Имя = Реквизит Тогда
						НайденныйРеквизит = РеквизитМд;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если НайденныйРеквизит <> Неопределено Тогда
				Список.Добавить(НайденныйРеквизит.Имя, ?(ЗначениеЗаполнено(НайденныйРеквизит.Синоним), НайденныйРеквизит.Синоним, НайденныйРеквизит.Синоним));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Список.Добавить("ABCКласс", НСтр("ru='ABC класс';en='ABC Class'"));
	Список.Добавить("XYZКласс", НСтр("ru='XYZ класс';en='XYZ class'"));
	Возврат Список;
КонецФункции

#Область ПервыйСтарт

// Осуществляет начальное заполнение настроек версионирования.
//
Процедура НачальноеЗаполнениеНастроекВерсионирования() Экспорт
	
	// Интересы
	РеквизитыИнтереса = Новый Массив;
	РеквизитыИнтереса.Добавить("СостояниеИнтереса");
	РеквизитыИнтереса.Добавить("ОжидаемаяВыручка");
	РеквизитыИнтереса.Добавить("Партнер");
	РеквизитыИнтереса.Добавить("КонтактноеЛицо");
	РеквизитыИнтереса.Добавить("ПотенциальныйКлиент");
	РеквизитыИнтереса.Добавить("Организация");
	РеквизитыИнтереса.Добавить("Ответственный");
	РеквизитыИнтереса.Добавить("Подразделение");
	РеквизитыИнтереса.Добавить("ТипУслуги");
	РеквизитыИнтереса.Добавить("Тема");
	РеквизитыИнтереса.Добавить("ТипОбращения");
	РеквизитыИнтереса.Добавить("Офис");
	
	// Партнеры
	РеквизитыПартнера = Новый Массив;
	РеквизитыПартнера.Добавить("БизнесРегион");
	РеквизитыПартнера.Добавить("ДатаРегистрации");
	РеквизитыПартнера.Добавить("Комментарий");
	РеквизитыПартнера.Добавить("Наименование");
	РеквизитыПартнера.Добавить("НаименованиеПолное");
	РеквизитыПартнера.Добавить("ОсновнойМенеджер");
	РеквизитыПартнера.Добавить("ДоговорПоУмолчанию");
	РеквизитыПартнера.Добавить("ЮрФизЛицо");
	РеквизитыПартнера.Добавить("Пол");
	РеквизитыПартнера.Добавить("ДатаРождения");
	РеквизитыПартнера.Добавить("CRM_Важность");
	РеквизитыПартнера.Добавить("CRM_ДатаРегистрацииКомпании");
	РеквизитыПартнера.Добавить("CRM_Имя");
	РеквизитыПартнера.Добавить("CRM_ИНН");
	РеквизитыПартнера.Добавить("CRM_КодПоОКПО");
	РеквизитыПартнера.Добавить("CRM_КПП");
	РеквизитыПартнера.Добавить("CRM_ОГРН");
	РеквизитыПартнера.Добавить("CRM_ОсновнаяОтрасль");
	РеквизитыПартнера.Добавить("CRM_ОсновноеКонтактноеЛицо");
	РеквизитыПартнера.Добавить("CRM_ОтписалсяОтEmailРассылок");
	РеквизитыПартнера.Добавить("CRM_Отчество");
	РеквизитыПартнера.Добавить("CRM_Потенциал");
	РеквизитыПартнера.Добавить("CRM_СегментРынка");
	РеквизитыПартнера.Добавить("CRM_СтатусРаботы");
	РеквизитыПартнера.Добавить("CRM_ТипОтношенийПредставление");
	РеквизитыПартнера.Добавить("CRM_Фамилия");
	РеквизитыПартнера.Добавить("CRM_ФизЛицо");
	РеквизитыПартнера.Добавить("CRM_Фотография");
	РеквизитыПартнера.Добавить("CRM_ЧисленностьРабочихМест");
	РеквизитыПартнера.Добавить("CRM_ЧисленностьСотрудников");
	РеквизитыПартнера.Добавить("БанковскийСчетПоУмолчанию");
	РеквизитыПартнера.Добавить("ДоговорПоУмолчанию");
	РеквизитыПартнера.Добавить("CRM_Автор");
	РеквизитыПартнера.Добавить("CRM_ГоловнаяОрганизация");
	РеквизитыПартнера.Добавить("Родитель");
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица);
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СайтПартнера);
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_ЮрАдрес);
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПартнера);
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	РеквизитыПартнера.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	РеквизитыПартнера.Добавить("Сегмент");
	
	// КонтактныеЛица
	РеквизитыКЛ = Новый Массив;
	РеквизитыКЛ.Добавить("Владелец");
	РеквизитыКЛ.Добавить("Пол");
	РеквизитыКЛ.Добавить("Наименование");
	РеквизитыКЛ.Добавить("ДатаРождения");
	РеквизитыКЛ.Добавить("CRM_Должность");
	РеквизитыКЛ.Добавить("CRM_Имя");
	РеквизитыКЛ.Добавить("CRM_Отчество");
	РеквизитыКЛ.Добавить("CRM_Фамилия");
	РеквизитыКЛ.Добавить("CRM_Фотография");
	РеквизитыКЛ.Добавить("CRM_РольКонтактногоЛица");
	РеквизитыКЛ.Добавить("CRM_СтатусыПредставление");
	РеквизитыКЛ.Добавить("CRM_Состояние");
	РеквизитыКЛ.Добавить("CRM_ОтписалсяОтEmailРассылок");
	РеквизитыКЛ.Добавить("CRM_ЛичныеИнтересы");
	РеквизитыКЛ.Добавить("CRM_ТипОтношенийПредставление");
	РеквизитыКЛ.Добавить("Комментарий");
	РеквизитыКЛ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
	РеквизитыКЛ.Добавить(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	РеквизитыКЛ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	
	СтруктураНастройки = Новый Структура("Реквизиты,РеквизитыКонтактногоЛица,РеквизитыИнтереса", РеквизитыПартнера, РеквизитыКЛ, РеквизитыИнтереса);
	
	РегистрыСведений.CRM_НастройкаВерсионированияРеквизитовПартнеров.СохранитьНастройку(СтруктураНастройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
